tap "alexanderwillner/tap"
tap "homebrew/bundle"
tap "homebrew/cask-versions"

brew "alexanderwillner/tap/things.sh"
brew "asciinema"
brew "autojump"
brew "awscli"
brew "bash-completion"
brew "exiftool"
brew "fx" # json tool
brew "git"
brew "graphviz"
brew "httpie"
brew "hugo"
brew "jq"
brew "md5sha1sum"
brew "openssl"
brew "pdftohtml"
brew "testdisk"
brew "thefuck"
brew "tldr"
brew "trash"
brew "tree"
brew "vcprompt"
brew "watch"
brew "wget"
brew "yarn"

cask "1password"
cask "aerial"
cask "charles"
cask "choosy"
cask "discord"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "grammarly"
cask "keepingyouawake"
cask "keycastr"
cask "libreoffice"
cask "maccy"
cask "menumeters"
cask "netnewswire"
cask "oversight"
cask "piezo"
cask "postman"
cask "qlmarkdown"
cask "rectangle"
cask "screen"
cask "slack"
cask "syncthing"
cask "syntax-highlight"
cask "textmate"
cask "tunnelbear"
cask "typora"
cask "vlc"
cask "whatsapp"

brew "mas"
mas "com.helloresolven.GIF-Brewery-3", id: 1081413713
mas "com.kevinsilmore.Randomness", id: 673815312
mas "cx.c3.theunarchiver", id: 425424353
mas "Things", id: 904280696
mas "Xcode", id: 497799835
